#если dictricts пустой массив то используем значение из tz
#

utc_plus_2 = [
    {'name':'Калининградская область','code':39,'districts':()}
]

#UTC+3
utc_plus_3 = [
    {'name':'Республика Адыгея','code':1,'districts':()},
    {'name':'Республика Дагестан','code':5,'districts':()},
    {'name':'Республика Ингушетия','code':6,'districts':()},
    {'name':'Кабардино-Балкарская Республика','code':7,'districts':()},
    {'name':'Республика Калмыкия','code':8,'districts':()},
    {'name':'Карачаево-Черкесская Республика','code':9,'districts':()},
    {'name':'Республика Карелия','code':10,'districts':()},
    {'name':'Республика Коми','code':11,'districts':()},
    {'name':'Республика Крым','code':91,'districts':()},
    {'name':'Республика Марий Эл','code':12,'districts':()},
    {'name':'Республика Мордовия','code':13,'districts':()},
    {'name':'Республика Северная Осетия - Алания','code':15,'districts':()},
    {'name':'Республика Татарстан (Татарстан)','code':16,'districts':()},
    {'name':'Чеченская Республика','code':20,'districts':()},
    {'name':'Чувашская Республика - Чувашия','code':21,'districts':()},
    {'name':'Краснодарский край','code':23,'districts':()},
    {'name':'Ставропольский край','code':26,'districts':()},
    {'name':'Архангельская область','code':29,'districts':()},
    {'name':'Белгородская область','code':31,'districts':()},
    {'name':'Брянская область','code':32,'districts':()},
    {'name':'Владимирская область','code':33,'districts':()},
    {'name':'Вологодская область','code':35,'districts':()},
    {'name':'Воронежская область','code':36,'districts':()},
    {'name':'Ивановская область','code':37,'districts':()},
    {'name':'Калужская область','code':40,'districts':()},
    {'name':'Кировская область','code':43,'districts':()},
    {'name':'Костромская область','code':44,'districts':()},
    {'name':'Курская область','code':46,'districts':()},
    {'name':'Ленинградская область','code':47,'districts':()},
    {'name':'Липецкая область','code':48,'districts':()},
    {'name':'Московская область','code':50,'districts':()},
    {'name':'Мурманская область','code':51,'districts':()},
    {'name':'Нижегородская область','code':52,'districts':()},
    {'name':'Новгородская область','code':53,'districts':()},
    {'name':'Орловская область','code':57,'districts':()},
    {'name':'Пензенская область','code':58,'districts':()},
    {'name':'Псковская область','code':60,'districts':()},
    {'name':'Ростовская область','code':61,'districts':()},
    {'name':'Рязанская область','code':62,'districts':()},
    {'name':'Смоленская область','code':67,'districts':()},
    {'name':'Тамбовская область','code':68,'districts':()},
    {'name':'Тверская область','code':69,'districts':()},
    {'name':'Тульская область','code':71,'districts':()},
    {'name':'Ярославская область','code':76,'districts':()},
    {'name':'Москва','code':77,'districts':()},
    {'name':'Санкт-Петербург','code':78,'districts':()},
    {'name':'Севастополь','code':92,'districts':()},
    {'name':'Ненецкий автономный округ','code':83,'districts':()},
]

utc_plus_4 = [
    {'name':'Удмуртская Республика','code':18,'districts':()},
    {'name':'Астраханская область','code':30,'districts':()},
    {'name':'Волгоградская область','code':34,'districts':()},
    {'name':'Самарская область','code':63,'districts':()},
    {'name':'Саратовская область','code':64,'districts':()},
    {'name':'Ульяновская область','code':73,'districts':()},
]

utc_plus_5 = [
    {'name':'Республика Башкортостан','code':2,'districts':()},
    {'name':'Пермский край','code':59,'districts':()},
    {'name':'Курганская область','code':45,'districts':()},
    {'name':'Оренбургская область','code':56,'districts':()},
    {'name':'Свердловская область','code':66,'districts':()},
    {'name':'Тюменская область','code':72,'districts':()},
    {'name':'Челябинская область','code':74,'districts':()},
    {'name':'Ханты-Мансийский автономный округ - Югра','code':86,'districts':()},
    {'name':'Ямало-Ненецкий автономный округ','code':89,'districts':()}
]

utc_plus_6 = [{'name':'Омская область','code':55,'districts':()}]

utc_plus_7 = [
    {'name':'Республика Алтай','code':4,'districts':()},
    {'name':'Республика Тыва','code':17,'districts':()},
    {'name':'Республика Хакасия','code':19,'districts':()},
    {'name':'Алтайский край','code':4,'districts':()},
    {'name':'Красноярский край','code':24,'districts':()},
    {'name':'Кемеровская область','code':42,'districts':()},
    {'name':'Новосибирская область','code':54,'districts':()},
    {'name':'Томская область','code':70,'districts':()},
]

utc_plus_8 = [
    {'name':'Республика Бурятия','code':3,'districts':()},
    {'name':'Иркутская область','code':38,'districts':()}
]

utc_plus_9 = [
    {'name':'Республика Саха (Якутия)','code':14, 'districts':('Алданский',
    'Амгинский', 'Анабарский', 'Булунский',
    'Верхневилюйский', 'Вилюйский', 'Горный',
    'Жиганский национальный эвенкийский', 'Кобяйский',
    'Ленский', 'Мегино-Кангаласский', 'Мирнинский',
    'Намский', 'Нерюнгринский', 'Нюрбинский',
    'Олекминский', 'Оленекский эвенкийский национальный',
    'Сунтарский', 'Таттинский', 'Томпонский',
    'Усть-Алданский', 'Усть-Майский', 'Хангаласский',
    'Чурапчинский', 'Эвено-Бытантайский', 'Якутск')}, 
    {'name':'Забайкальский край','code':75,'districts':()},
    {'name':'Амурская область','code':28,'districts':()},
]

utc_plus_10 = [
    {'name':'Республика Саха (Якутия)','code':14, 'districts':('Верхоянский',
    'Оймяконский', 'Усть-Янский')},
    {'name':'Приморский край','code':25,'districts':()},
    {'name':'Хабаровский край','code':27,'districts':()},
    {'name':'Еврейская автономная область', 'code':79,'districts':()},
]

utc_plus_11 = [
    {'name':'Республика Саха (Якутия)', 'code':14, 'districts':('Абыйский',
    'Аллаиховский', 'Верхнеколымский', 'Момский',
    'Нижнеколымский', 'Среднеколымский')},
    {'name':'Магаданская область', 'code':49,'districts':()},
    {'name':'Сахалинская область', 'code':65,'districts':()},
]

utc_plus_12 = [
    {'name':'Камчатский край','code':41,'districts':()},
    {'name':'Чукотский автономный округ','code':87,'districts':()}
]

msk_to_utc_tz_map = {'msk-1':'utc+2', 'msk':'utc+3','msk+1':'utc+4','msk+2':'utc+5','msk+3':'utc+6',
'msk+4':'utc+7', 'msk+5':'utc+8','msk+6':'utc+9','msk+7':'utc+10','msk+8':'utc+11','msk+9':'utc+12'}

fedsubj_tz_map = {'msk-1':utc_plus_2, 'msk':utc_plus_3, 'msk+1':utc_plus_4, 'msk+2':utc_plus_5,
    'msk+3':utc_plus_6, 'msk+4':utc_plus_7, 'msk+5':utc_plus_8, 'msk+6':utc_plus_9, 
    'msk+7':utc_plus_10, 'msk+8':utc_plus_11, 'msk+9':utc_plus_12 
}